"下一步" = "الخطوة التالية";
"当前没有可编辑的资源" = "لا يوجد حاليا أي موارد قابلة للتعديل";
"当前没有可删除的资源" = "لا توجد حاليا أي موارد لحذفها";
"确定删除这张照片吗?" = "هل أنت متأكد من حذف هذه الصورة؟";
"确定删除这个视频吗?" = "هل أنت متأكد من حذف هذا الفيديو؟";
"删除" = "حذف";
"下载失败，请重试！" = "فشل التنزيل ، يرجى المحاولة مرة أخرى!";
"编辑" = "تعديل";
"正在下载iCloud上的资源" = "تنزيل الموارد على iCloud";
"原始值" = "القيمة الأصلية";
"正方形" = "ميدان";
"提示" = "تلميح";
"是否删除此照片" = "ما إذا كان سيتم حذف هذه الصورة";
"还原" = "اختزال";
"选择" = "أختر";
"旋转" = "يلف";
"选择照片时不能选择视频" = "لا يمكن تحديد الفيديو عند اختيار الصور";
"没有照片可选!" = "لا توجد صور متاحة!";
"张照片" = "صورة";
"个视频" =  "فيديو";
"Photos" = "صورة";
"Photo" = "صورة";
"Videos" = "فيديو";
"Video" = "فيديو";
"今天" = "اليوم";
"昨天" = "في الامس";
"返回"= "إرجاع";
"取消" = "يلغي";
"预览" = "معاينة";
"原图" = "الصورة الأصلية";
"设置" = "يثبت";
"确定" = "بالتأكيد";
"完成" = "ينهي";
"关闭" = "إنهاء";
"拍摄" = "أطلق النار";
"拍摄失败" = "فشل التصوير";
"裁剪" = "ا & قتصاص";
"抱歉" = "يشعر بالأسف";
"重拍" = "طبعة جديدة";
"相机" = "الة تصوير";
"照片" = "صورة فوتوغرافية";
"视频" = "فيديو";
"相册" = "إلبوم الصور";
"加载中" = "جار التحميل";
"处理中" = "يعالج";
"点击拍照" = "انقر لالتقاط صورة";
"长按录像" = "اضغط لفترة طويلة للتسجيل";
"点击拍照，长按录像" = "اضغط لالتقاط صورة ، اضغط لفترة طويلة للتسجيل";
"处理失败,请重试!" = "فشلت المعالجة ، يرجى المحاولة مرة أخرى!";
"无法使用相机!" = "لا يمكن استخدام الكاميرا!";
"照片正在下载" = "يتم تنزيل الصور";
"已达最大数!" = "تم الوصول إلى الحد الأقصى للعدد!";
"照片已达最大数!" = "بلغ عدد الصور الحد الأقصى!";
"视频已达最大数!" = "بلغ عدد مقاطع الفيديو الحد الأقصى!";
"最多只能选择%ld张图片" = "يمكنك فقط تحديد%ldصورة على الأكثر";
"最多只能选择%ld个视频" = "يمكن تحديد%ld من مقاطع الفيديو فقط على الأكثر";
"最多只能选择%ld个" = "يمكنك فقط تحديد%ld على الأكثر";
"图片不能和视频同时选择" = "لا يمكن تحديد الصورة والفيديو في نفس الوقت";
"视频不能和图片同时选择" = "لا يمكن تحديد الفيديو والصور في نفس الوقت";
"视频少于%ld秒，无法选择" = "الفيديو أقل من%ld  ثانية ولا يمكن تحديده";
"视频大于%ld秒，无法选择" = "الفيديو أطول من%ld ثانية ولا يمكن تحديده";
"录制时间少于%.0f秒" = "وقت التسجيل أقل من%.0f ثانية";
"请在设置-隐私-相机中允许访问相机" = "يرجى السماح بالوصول إلى الكاميرا في الإعدادات - الخصوصية - الكاميرا";
"无法访问照片\n请点击这里前往设置中允许访问照片" = "يتعذر الوصول إلى الصور \ n الرجاء النقر هنا للانتقال إلى الإعدادات للسماح بالوصول إلى الصور";
"无法使用相机" = "لا يمكن استخدام الكاميرا";
"无法访问照片，请前往设置中允许\n访问照片" = "تعذر الوصول إلى الصورة ، الرجاء الانتقال إلى الإعدادات للسماح \ n بالوصول إلى الصورة";
"无法使用麦克风" = "لا يمكن استخدام الميكروفون";
"请在设置-隐私-相机中允许访问麦克风" = "يرجى السماح بالوصول إلى الميكروفون في الإعدادات - الخصوصية - الكاميرا";
"视频保存失败!" = "فشل حفظ الفيديو!";
"照片保存失败!" = "فشل حفظ الصورة!";
"保存失败，无法访问照片\n请前往设置中允许访问照片" = "فشل الحفظ ، غير قادر على الوصول إلى الصورة \ n الرجاء الانتقال إلى الإعدادات للسماح \ n بالوصول إلى الصورة";
"没有可选的照片!" = "لا توجد صور متاحة!";
"视频已被删除!" = "تم حذف الفيديو!";
"尚未从iCloud上下载，请至系统相册下载完毕后选择" = "لم يتم تنزيله من iCloud ، يرجى الانتقال إلى ألبوم النظام وتحديده بعد التنزيل";
"今天" = "اليوم";
"昨天" = "في الامس";
"麦克风添加失败，录制视频会没有声音哦!" = "فشل إضافة ميكروفون ، لن يكون هناك صوت عند تسجيل الفيديو!";
"点击录制" = "انقر للتسجيل";
"%.0f秒内的视频无效哦~" = "%.0fالفيديو في غضون ثوان غير صالح ~";
"录制视频失败!" = "فشل في تسجيل الفيديو!";
"继续录制" = "استمر في التسجيل";
"无法访问相册" = "لا يمكن الوصول إلى الألبوم";
"请在设置-隐私-相册中允许访问相册" = "الرجاء السماح بالوصول إلى الألبوم في الإعدادات - الخصوصية - الألبوم";
"下载失败" = "التحميل فشل";
"所有照片" = "جميع الصور";
"相机胶卷" = "فلم الة التصوير";
"编辑后，GIF将会变为静态图，确定继续吗？" = "بعد التحرير ، سيصبح GIF صورة ثابتة ، هل أنت متأكد من المتابعة؟";
"编辑后，LivePhoto将会变为静态图，确定继续吗？" = "بعد التحرير ، ستصبح LivePhoto صورة ثابتة. هل أنت متأكد من المتابعة؟";
"图片尺寸过小!" = "حجم الصورة صغير جدا!";
"获取视频失败!" = "فشل الحصول على الفيديو!";
"确定取消吗?" = "هل أنت متأكد من الإلغاء؟";
"继续" = "استمر";
"获取" = "يحصل على";
"处理失败，请重试" = "فشلت المعالجة ، يرجى المحاولة مرة أخرى!";
"选择照片时不能选择视频" = "لا يمكن تحديد الفيديو عند اختيار الصور";
"选择视频时不能选择照片" = "لا يمكن تحديد الصور عند اختيار الفيديو";
"只能选择%ld秒内的视频，需进行编辑" = "يمكن تحديد مقاطع الفيديو فقط في غضون%ld ثانية ويجب تحريرها";
"从手机相册选择" = "اختر من ألبوم الهاتف";
"正在下载网络图片，请稍等" = "جارٍ تنزيل صور الشبكة ، يرجى الانتظار";
"正在获取照片大小，请稍等" = "جاري استرداد حجم الصورة ، برجاء الانتظار";
"照片大小超过最大限制%@" = "حجم الصورة يتجاوز الحد الأقصى%@";
"视频大小超过最大限制%@" = "حجم الفيديو يتجاوز الحد الأقصى%@";
"照片或视频" = "صورة أو فيديو";
"轻触拍照" = "اضغط لالتقاط صورة";
"按住摄像" = "عقد الفيديو";
"轻触拍照，按住摄像" = "انقر لالتقاط صورة ، واضغط مع الاستمرار لالتقاط صورة";
"拍照" = "تصوير";
"摄像" = "الة تصوير";
"无法访问所有照片\n请点击这里前往设置中允许访问所有照片" = "يتعذر الوصول إلى كافة الصور \ n الرجاء النقر هنا للانتقال إلى الإعدادات للسماح بالوصول إلى كافة الصور";
"无法访问所有照片" = "لا يمكن الوصول إلى كل الصور";
"请在设置-隐私-相册中允许访问所有照片" = "الرجاء السماح بالوصول إلى جميع الصور في الإعدادات - الخصوصية - الألبوم";
"要删除这张照片吗?" = "هل تريد حذف هذه الصورة؟";
"要删除此视频吗?" = "هل تريد حذف هذا الفيديو؟";
"自由" = "مجانا";
"松手即可删除" = "دعنا نذهب للحذف";
"拖动到此处删除" = "اسحب هنا للحذف";
"仅可访问部分照片，建议开启「所有照片」" = "يمكن الوصول إلى بعض الصور فقط ، يوصى بفتح جميع الصور";
"去设置" = "انتقل إلى المجموعة";
"更多" = "أكثر";

"HXAlbumCameraRoll" = "جميع الصور";
"HXAlbumPanoramas" = "صورة بانورامية";
"HXAlbumVideos" = "فيديو";
"HXAlbumFavorites" = "مجموعة شخصية";
"HXAlbumTimelapses" = "المعدل الزمني للتصوير";
"HXAlbumRecents" = "مشاريع حديثه";
"HXAlbumRecentlyAdded" = "أضيف مؤخرا";
"HXAlbumBursts" = "لقطة مستمرة";
"HXAlbumSlomoVideos" = "حركة بطيئة";
"HXAlbumSelfPortraits" = "سيلفي";
"HXAlbumScreenshots" = "لقطة شاشة";
"HXAlbumDepthEffect" = "لوحة";
"HXAlbumLivePhotos" = "صور حية";
"HXAlbumAnimated" = "GIF";
